Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.Rotation Property
Note: This API is now obsolete.
Gets or sets value of rotation around Z axis (degrees).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Use Rotation3D instead")]
public double Rotation { get; set; }
<ObsoleteAttribute("Use Rotation3D instead")>
Public Property Rotation As Double
	Get
	Set
Property Value
Type: Double
Remarks
Reading result is only specified exactly when there are no other rotations. Otherwise it is approximate. Writing resets the other rotations so that the overall rotation is only around Z axis.
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace